plan output 
```
Terraform will perform the following actions:

  # module.pipeline.module.inference_capacity_provider.aws_autoscaling_group.asg will be updated in-place
  ~ resource "aws_autoscaling_group" "asg" {
        id                               = "catalogue-2024-11-18_inferrer_asg"
        name                             = "catalogue-2024-11-18_inferrer_asg"
        # (31 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-08e9ccbdd2fc3f653"
            name    = "catalogue-2024-11-18_inferrer_launch_template"
          ~ version = "6" -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.pipeline.module.inference_capacity_provider.aws_launch_template.launch_template will be updated in-place
  ~ resource "aws_launch_template" "launch_template" {
      ~ default_version                      = 6 -> (known after apply)
        id                                   = "lt-08e9ccbdd2fc3f653"
      ~ image_id                             = "ami-0e2f232aebbf02203" -> "ami-09966819cca907099"
      ~ latest_version                       = 6 -> (known after apply)
        name                                 = "catalogue-2024-11-18_inferrer_launch_template"
        tags                                 = {}
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.pipeline.module.relation_embedder_sub.module.embedder_lambda.aws_lambda_event_source_mapping.event_source_mapping will be updated in-place
  ~ resource "aws_lambda_event_source_mapping" "event_source_mapping" {
        id                                 = "6229e625-4e57-4031-92df-55ad2093457e"
        tags                               = {}
        # (24 unchanged attributes hidden)

      - metrics_config {
          - metrics = [] -> null
        }

        # (1 unchanged block hidden)
    }

  # module.pipeline.module.relation_embedder_sub.module.embedder_lambda.module.pipeline_step.aws_lambda_function.main will be updated in-place
  ~ resource "aws_lambda_function" "main" {
        id                             = "catalogue-2024-11-18-r_embed_embedder"
      ~ memory_size                    = 1024 -> 2048
        tags                           = {}
        # (27 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

Plan: 0 to add, 4 to change, 0 to destroy.
```